app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 5)

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dasdsaasddasds12312"], ["summary", "123123"], ["body", "<div>12312312</div>"], ["created_at", "2019-06-04 00:16:55.694065"], ["updated_at", "2019-06-04 00:16:55.694065"]]
---
   def create
     @post = Post.new(post_params)
     if @post.save