app/models/post.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 1]]
---
  def all_tags
    self.tags.map(&:name).join(',')

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "Ruby,css,html"], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "23423"], ["created_at", "2019-06-04 01:04:02.469182"], ["updated_at", "2019-06-04 01:04:02.469182"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "Ruby"], ["LIMIT", 1]]
---
def all_tags=(names)
  self.tags = names.split(',').map do |name|
    Tag.where(name: name.strip).first_or_create